module FLiBe
    ##### 液相密度 kg/m3 #####
    ρ(T) = 2413.1 - 0.4884*T 
    ##### 液相定压比热 #J·kg^-1·K^-1 #####
    cp(T) = 2380.6
    ##### 液相比熵 J·kg^-1·K^-1 #####
    s(T) = cp(T)*log(T)
    ##### 液相比焓 J·kg^-1 #####
    h(T) = cp(T)*T
    ##### 液相比焓反解温度 K #####
    h_T(h) = h/cp(745.5)
    ##### 粘度 Pa·s #####
    μ(T) = 0.000116*exp(3755/T)
    ##### 热导率 W·m^-1·K^-1 #####
    λ(T) = 1.1
    ##### 饱和蒸气压 W·m^-1·K^-1 #####
    p0(T) = pow(10,11.914-13003/T)
    ##### 表面张力 N·m^-1 #####
    σ(T) = 0.295778-0.00012*T
    ##### 电导率 Ω·cm^-1 #####
    κ(T) = -3.9067+7.499*pow(10,-3)*T-0.5702*pow(10,-6)*T*T    
    ##### 普朗特数 #####
    Pr(T) = μ(T)*cp(T)/λ(T)
    export 
    ρ,cp,s,h,h_T,μ,λ,p0,σ,κ,Pr    
end

module FLiNaK
    ##### 液相密度 kg/m3 #####
    ρ(T) = 2729 - 0.73*T
    ##### 液相定压比热 #J·kg^-1·K^-1 #####
    cp(T) = 1884
    ##### 液相比熵 J·kg^-1·K^-1 #####
    s(T) = cp(T)*log(T)
    ##### 液相比焓 J·kg^-1 #####
    h(T) = cp(T)*T
    ##### 液相比焓反解温度 K #####
    h_T(h) = h/cp(745.5)
    ##### 粘度 Pa·s #####
    μ(T) = 0.00004*exp(4170/T)
    ##### 热导率 W·m^-1·K^-1 #####
    λ(T) = 0.0005*T + 0.43
    ##### 普朗特数 #####
    Pr(T) = μ(T)*cp(T)/λ(T)
    export 
    ρ,cp,s,h,h_T,μ,λ,Pr    
end
